1m3_27mm_wall_H2_test_55/0.orig/H2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0; // mass fraction

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            inletOutlet;  //zeroGradient;
        inletValue      $internalField; 
        value           $internalField;        
    }
    front
    {
        type            inletOutlet;  //zeroGradient;
        inletValue      $internalField; 
        value           $internalField;        
    }
    back
    {
        type            inletOutlet;  //zeroGradient;
        inletValue      $internalField; 
        value           $internalField;        
    }
    bottom_wall
    {
        type            zeroGradient;
    }
    top
    {
        type            inletOutlet;  //zeroGradient;
        inletValue      $internalField; 
        value           $internalField;        
    }
    nozzle_27mm_5mm_m
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            fixedValue;
        value           uniform 1.0; 
    }
    box_shell_m
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
